tutorials/multiRegionHeater/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionFoam;

startFrom       latestTime;

startTime       0.001;

stopAt          endTime;

endTime         50;

deltaT          1e-3;

writeControl    adjustableRunTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

maxCo           0.6;

// Maximum diffusion number
maxDi           10.0;

adjustTimeStep  yes;

functions
{
  exportCGNS_bottomWater
    {
      type     exportFoamCGNS;
      functionObjectLibs ("libexportFoamCGNS.so");
      outputControl adjustableTime;//timeStep;//runTime;//timeStep;
      writeInterval 0.5;
      region bottomWater;
      //      outputInterval 1;
      filename "bottomWater.foamcgns";
      fields (p U T h);
    }
    exportCGNS_topAir
    {
      $exportCGNS_bottomWater;
      region topAir;      
      filename "topAir.foamcgns";
    }  
    exportCGNS_heater
    {
      $exportCGNS_bottomWater;
      region heater;      
      filename "heater.foamcgns";
      fields (p T h);	
    }
    exportCGNS_leftSolid
    {
      $exportCGNS_heater;
      region leftSolid;
      filename "leftSolid.foamcgns";
    }
    exportCGNS_rightSolid
    {
      $exportCGNS_heater;
      region rightSolid;      
      filename "rightSolid.foamcgns";
    }

}

// ************************************************************************* //
